Revit 2025 API
NavisworksParameters Enumeration
 An enumerated type listing possible "Parameter conversions" of Navisworks Exporter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum NavisworksParameters
Public Enumeration NavisworksParameters
public enum class NavisworksParameters
type NavisworksParameters
Members
Member name | Value | Description
None | 0 |  The file exporter does not convert parameters.
Elements | 1 |  The file exporter converts parameters for all found elements.
All | 2 |  The file exporter converts parameters for all found elements, including the referenced elements. As a result, extra property tabs are available in Autodesk Navisworks.
See Also
Reference
Autodesk.Revit.DB Namespace